app/Controllers/News.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('a new news', 'a-new-news', 'description')
---
	public function create()
	{
		helper('form');

		$data = $this->request->getPost(['title', 'body']);

		if(! $this->validateData($data, [
			'title' => 'required|max_length[255]|min_length[3]',
			'body' => 'required|max_length[5000]|min_length[10]',
		])){
			return $this->new();
		}

		$post=$this->validator->getValidated();

		$model = model(NewsModel::class);

		$model->save([
			'title' => $post['title'],
			'slug' => url_title($post['title'], '-', true),
			'body' => $post['body'],
		]);